#version: 0.2
h e
Ġ t
Ġ a
Ġ s
Ġ w
n d
Ġt he
e d
Ġa nd
Ġt o
Ġ b
i n
Ġ h
Ġw a
r e
o u
Ġ f
i t
Ġ l
Ġ c
Ġ d
e r
Ġ he
Ġ m
Ġ p
Ġwa s
o m
Ġ T
Ġ o
a y
a r
i s
in g
i l
Ġ g
i d
a t
e n
Ġ n
Ġs a
Ġh a
Ġ S
ĠT he
a n
i m
o r
o n
Ġ it
Ġt h
l l
l e
Ġ H
Ġhe r
o t
e t
i r
ĠS he
e s
ĠH e
Ġ in
v er
u t
o w
ĠThe y
c k
Ġ e
Ġ u
l d
Ġ y
o o
Ġsa id
i g
Ġ "
il y
Ġ r
Ġb e
a m
Ġs t
Ġ I
c e
k e
Ġs he
v e
p p
it h
Ġw ith
L ily
O n
Ġo n
Ġy ou
Ġo f
k ed
r i
Ġs o
n t
Ġh is
Ġp l
a d
ver y
Ġd ay
Ġth at
Ġu p
Ġpl ay
Ġha d
s t
Ġthe y
Ġw e
Ġ Lily
Ġm om
Ġf or
Ġ B
e l
u n
ou ld
' s
m y
T he
Ġl i
c h
en t
Ġha pp
Ġwa nt
it t
Ġs h
ou t
he r
Ġd o
l y
Ġn ot
om e
s e
Ġ very
ou nd
e nd
a ll
Ġw h
im e
itt le
Ġ k
Ġt ime
Ġl ittle
a l
Ġthe re
Ġn e
h t
Ġ M
Ġ re
Ġhapp y
Ġs m
Ġb ig
Ġ is
Ġ Ċ
ĠI t
Ġb ut
a ck
Ġa n
Ġsa w
ri end
. "
Ġf riend
r y
Ġa s
r a
On e
id e
a ke
' t
! "
u g
Ġl oo
v ed
t er
Ġwe re
o re
On ce
Ġl o
e c
Ġh im
Ġto o
Ġg o
Ġb o
Ġs e
ir l
Ġa re
Ġ j
ĠT im
ar d
Ġwant ed
il l
Ġg irl
Ġup on
Ġthe m
Ġ out
Ġa t
u r
i nd
Ġthe ir
f u
Ġs p
w ay
Ġ A
Ġsm il
Ġd id
Ġc ould
he n
Ġha ve
a in
ar t
Ġe x
he d
r om
Ġw ent
Ġa r
i c
Ġc an
Ġ J
l p
fu l
ĠB en
oo d
? "
h ing
Ġfriend s
Ġn am
ig ht
Ġa ll
Ġhe lp
Ġk n
u m
on e
ar k
Ġb ack
Ġs ay
Y ou
Ġf un
Ġc l
ĠT om
a re
Ġn o
Ġl e
o p
Ġsmil ed
Ġs c
Ġnam ed
Ġa l
ou g
Ġlo ved
s ide
el t
Ġ One
Ġm an
Ġas ked
i ck
Ġto y
Ġli ke
