{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|padding|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|padding|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "¡": 96,
      "¢": 97,
      "£": 98,
      "¤": 99,
      "¥": 100,
      "¦": 101,
      "§": 102,
      "¨": 103,
      "©": 104,
      "ª": 105,
      "«": 106,
      "¬": 107,
      "®": 108,
      "¯": 109,
      "°": 110,
      "±": 111,
      "²": 112,
      "³": 113,
      "´": 114,
      "µ": 115,
      "¶": 116,
      "·": 117,
      "¸": 118,
      "¹": 119,
      "º": 120,
      "»": 121,
      "¼": 122,
      "½": 123,
      "¾": 124,
      "¿": 125,
      "À": 126,
      "Á": 127,
      "Â": 128,
      "Ã": 129,
      "Ä": 130,
      "Å": 131,
      "Æ": 132,
      "Ç": 133,
      "È": 134,
      "É": 135,
      "Ê": 136,
      "Ë": 137,
      "Ì": 138,
      "Í": 139,
      "Î": 140,
      "Ï": 141,
      "Ð": 142,
      "Ñ": 143,
      "Ò": 144,
      "Ó": 145,
      "Ô": 146,
      "Õ": 147,
      "Ö": 148,
      "×": 149,
      "Ø": 150,
      "Ù": 151,
      "Ú": 152,
      "Û": 153,
      "Ü": 154,
      "Ý": 155,
      "Þ": 156,
      "ß": 157,
      "à": 158,
      "á": 159,
      "â": 160,
      "ã": 161,
      "ä": 162,
      "å": 163,
      "æ": 164,
      "ç": 165,
      "è": 166,
      "é": 167,
      "ê": 168,
      "ë": 169,
      "ì": 170,
      "í": 171,
      "î": 172,
      "ï": 173,
      "ð": 174,
      "ñ": 175,
      "ò": 176,
      "ó": 177,
      "ô": 178,
      "õ": 179,
      "ö": 180,
      "÷": 181,
      "ø": 182,
      "ù": 183,
      "ú": 184,
      "û": 185,
      "ü": 186,
      "ý": 187,
      "þ": 188,
      "ÿ": 189,
      "Ā": 190,
      "ā": 191,
      "Ă": 192,
      "ă": 193,
      "Ą": 194,
      "ą": 195,
      "Ć": 196,
      "ć": 197,
      "Ĉ": 198,
      "ĉ": 199,
      "Ċ": 200,
      "ċ": 201,
      "Č": 202,
      "č": 203,
      "Ď": 204,
      "ď": 205,
      "Đ": 206,
      "đ": 207,
      "Ē": 208,
      "ē": 209,
      "Ĕ": 210,
      "ĕ": 211,
      "Ė": 212,
      "ė": 213,
      "Ę": 214,
      "ę": 215,
      "Ě": 216,
      "ě": 217,
      "Ĝ": 218,
      "ĝ": 219,
      "Ğ": 220,
      "ğ": 221,
      "Ġ": 222,
      "ġ": 223,
      "Ģ": 224,
      "ģ": 225,
      "Ĥ": 226,
      "ĥ": 227,
      "Ħ": 228,
      "ħ": 229,
      "Ĩ": 230,
      "ĩ": 231,
      "Ī": 232,
      "ī": 233,
      "Ĭ": 234,
      "ĭ": 235,
      "Į": 236,
      "į": 237,
      "İ": 238,
      "ı": 239,
      "Ĳ": 240,
      "ĳ": 241,
      "Ĵ": 242,
      "ĵ": 243,
      "Ķ": 244,
      "ķ": 245,
      "ĸ": 246,
      "Ĺ": 247,
      "ĺ": 248,
      "Ļ": 249,
      "ļ": 250,
      "Ľ": 251,
      "ľ": 252,
      "Ŀ": 253,
      "ŀ": 254,
      "Ł": 255,
      "ł": 256,
      "Ń": 257,
      "he": 258,
      "Ġt": 259,
      "Ġa": 260,
      "Ġs": 261,
      "Ġw": 262,
      "nd": 263,
      "Ġthe": 264,
      "ed": 265,
      "Ġand": 266,
      "Ġto": 267,
      "Ġb": 268,
      "in": 269,
      "Ġh": 270,
      "Ġwa": 271,
      "re": 272,
      "ou": 273,
      "Ġf": 274,
      "it": 275,
      "Ġl": 276,
      "Ġc": 277,
      "Ġd": 278,
      "er": 279,
      "Ġhe": 280,
      "Ġm": 281,
      "Ġp": 282,
      "Ġwas": 283,
      "om": 284,
      "ĠT": 285,
      "Ġo": 286,
      "ay": 287,
      "ar": 288,
      "is": 289,
      "ing": 290,
      "il": 291,
      "Ġg": 292,
      "id": 293,
      "at": 294,
      "en": 295,
      "Ġn": 296,
      "Ġsa": 297,
      "Ġha": 298,
      "ĠS": 299,
      "ĠThe": 300,
      "an": 301,
      "im": 302,
      "or": 303,
      "on": 304,
      "Ġit": 305,
      "Ġth": 306,
      "ll": 307,
      "le": 308,
      "ĠH": 309,
      "Ġher": 310,
      "ot": 311,
      "et": 312,
      "ir": 313,
      "ĠShe": 314,
      "es": 315,
      "ĠHe": 316,
      "Ġin": 317,
      "ver": 318,
      "ut": 319,
      "ow": 320,
      "ĠThey": 321,
      "ck": 322,
      "Ġe": 323,
      "Ġu": 324,
      "ld": 325,
      "Ġy": 326,
      "oo": 327,
      "Ġsaid": 328,
      "ig": 329,
      "Ġ\"": 330,
      "ily": 331,
      "Ġr": 332,
      "Ġbe": 333,
      "am": 334,
      "Ġst": 335,
      "ĠI": 336,
      "ce": 337,
      "ke": 338,
      "Ġshe": 339,
      "ve": 340,
      "pp": 341,
      "ith": 342,
      "Ġwith": 343,
      "Lily": 344,
      "On": 345,
      "Ġon": 346,
      "Ġyou": 347,
      "Ġof": 348,
      "ked": 349,
      "ri": 350,
      "Ġso": 351,
      "nt": 352,
      "Ġhis": 353,
      "Ġpl": 354,
      "ad": 355,
      "very": 356,
      "Ġday": 357,
      "Ġthat": 358,
      "Ġup": 359,
      "Ġplay": 360,
      "Ġhad": 361,
      "st": 362,
      "Ġthey": 363,
      "Ġwe": 364,
      "ĠLily": 365,
      "Ġmom": 366,
      "Ġfor": 367,
      "ĠB": 368,
      "el": 369,
      "un": 370,
      "ould": 371,
      "'s": 372,
      "my": 373,
      "The": 374,
      "Ġli": 375,
      "ch": 376,
      "ent": 377,
      "Ġhapp": 378,
      "Ġwant": 379,
      "itt": 380,
      "Ġsh": 381,
      "out": 382,
      "her": 383,
      "Ġdo": 384,
      "ly": 385,
      "Ġnot": 386,
      "ome": 387,
      "se": 388,
      "Ġvery": 389,
      "ound": 390,
      "end": 391,
      "all": 392,
      "Ġwh": 393,
      "ime": 394,
      "ittle": 395,
      "Ġk": 396,
      "Ġtime": 397,
      "Ġlittle": 398,
      "al": 399,
      "Ġthere": 400,
      "Ġne": 401,
      "ht": 402,
      "ĠM": 403,
      "Ġre": 404,
      "Ġhappy": 405,
      "Ġsm": 406,
      "Ġbig": 407,
      "Ġis": 408,
      "ĠĊ": 409,
      "ĠIt": 410,
      "Ġbut": 411,
      "ack": 412,
      "Ġan": 413,
      "Ġsaw": 414,
      "riend": 415,
      ".\"": 416,
      "Ġfriend": 417,
      "ry": 418,
      "Ġas": 419,
      "ra": 420,
      "One": 421,
      "ide": 422,
      "ake": 423,
      "'t": 424,
      "!\"": 425,
      "ug": 426,
      "Ġloo": 427,
      "ved": 428,
      "ter": 429,
      "Ġwere": 430,
      "ore": 431,
      "Once": 432,
      "Ġlo": 433,
      "ec": 434,
      "Ġhim": 435,
      "Ġtoo": 436,
      "Ġgo": 437,
      "Ġbo": 438,
      "Ġse": 439,
      "irl": 440,
      "Ġare": 441,
      "Ġj": 442,
      "ĠTim": 443,
      "ard": 444,
      "Ġwanted": 445,
      "ill": 446,
      "Ġgirl": 447,
      "Ġupon": 448,
      "Ġthem": 449,
      "Ġout": 450,
      "Ġat": 451,
      "ur": 452,
      "ind": 453,
      "Ġtheir": 454,
      "fu": 455,
      "Ġsp": 456,
      "way": 457,
      "ĠA": 458,
      "Ġsmil": 459,
      "Ġdid": 460,
      "Ġcould": 461,
      "hen": 462,
      "Ġhave": 463,
      "ain": 464,
      "art": 465,
      "Ġex": 466,
      "hed": 467,
      "rom": 468,
      "Ġwent": 469,
      "Ġar": 470,
      "ic": 471,
      "Ġcan": 472,
      "ĠJ": 473,
      "lp": 474,
      "ful": 475,
      "ĠBen": 476,
      "ood": 477,
      "?\"": 478,
      "hing": 479,
      "Ġfriends": 480,
      "Ġnam": 481,
      "ight": 482,
      "Ġall": 483,
      "Ġhelp": 484,
      "Ġkn": 485,
      "um": 486,
      "one": 487,
      "ark": 488,
      "Ġback": 489,
      "Ġsay": 490,
      "You": 491,
      "Ġfun": 492,
      "Ġcl": 493,
      "ĠTom": 494,
      "are": 495,
      "Ġno": 496,
      "Ġle": 497,
      "op": 498,
      "Ġsmiled": 499,
      "Ġsc": 500,
      "Ġnamed": 501,
      "Ġal": 502,
      "oug": 503,
      "Ġloved": 504,
      "side": 505,
      "elt": 506,
      "ĠOne": 507,
      "Ġman": 508,
      "Ġasked": 509,
      "ick": 510,
      "Ġtoy": 511
    },
    "merges": [
      "h e",
      "Ġ t",
      "Ġ a",
      "Ġ s",
      "Ġ w",
      "n d",
      "Ġt he",
      "e d",
      "Ġa nd",
      "Ġt o",
      "Ġ b",
      "i n",
      "Ġ h",
      "Ġw a",
      "r e",
      "o u",
      "Ġ f",
      "i t",
      "Ġ l",
      "Ġ c",
      "Ġ d",
      "e r",
      "Ġ he",
      "Ġ m",
      "Ġ p",
      "Ġwa s",
      "o m",
      "Ġ T",
      "Ġ o",
      "a y",
      "a r",
      "i s",
      "in g",
      "i l",
      "Ġ g",
      "i d",
      "a t",
      "e n",
      "Ġ n",
      "Ġs a",
      "Ġh a",
      "Ġ S",
      "ĠT he",
      "a n",
      "i m",
      "o r",
      "o n",
      "Ġ it",
      "Ġt h",
      "l l",
      "l e",
      "Ġ H",
      "Ġhe r",
      "o t",
      "e t",
      "i r",
      "ĠS he",
      "e s",
      "ĠH e",
      "Ġ in",
      "v er",
      "u t",
      "o w",
      "ĠThe y",
      "c k",
      "Ġ e",
      "Ġ u",
      "l d",
      "Ġ y",
      "o o",
      "Ġsa id",
      "i g",
      "Ġ \"",
      "il y",
      "Ġ r",
      "Ġb e",
      "a m",
      "Ġs t",
      "Ġ I",
      "c e",
      "k e",
      "Ġs he",
      "v e",
      "p p",
      "it h",
      "Ġw ith",
      "L ily",
      "O n",
      "Ġo n",
      "Ġy ou",
      "Ġo f",
      "k ed",
      "r i",
      "Ġs o",
      "n t",
      "Ġh is",
      "Ġp l",
      "a d",
      "ver y",
      "Ġd ay",
      "Ġth at",
      "Ġu p",
      "Ġpl ay",
      "Ġha d",
      "s t",
      "Ġthe y",
      "Ġw e",
      "Ġ Lily",
      "Ġm om",
      "Ġf or",
      "Ġ B",
      "e l",
      "u n",
      "ou ld",
      "' s",
      "m y",
      "T he",
      "Ġl i",
      "c h",
      "en t",
      "Ġha pp",
      "Ġwa nt",
      "it t",
      "Ġs h",
      "ou t",
      "he r",
      "Ġd o",
      "l y",
      "Ġn ot",
      "om e",
      "s e",
      "Ġ very",
      "ou nd",
      "e nd",
      "a ll",
      "Ġw h",
      "im e",
      "itt le",
      "Ġ k",
      "Ġt ime",
      "Ġl ittle",
      "a l",
      "Ġthe re",
      "Ġn e",
      "h t",
      "Ġ M",
      "Ġ re",
      "Ġhapp y",
      "Ġs m",
      "Ġb ig",
      "Ġ is",
      "Ġ Ċ",
      "ĠI t",
      "Ġb ut",
      "a ck",
      "Ġa n",
      "Ġsa w",
      "ri end",
      ". \"",
      "Ġf riend",
      "r y",
      "Ġa s",
      "r a",
      "On e",
      "id e",
      "a ke",
      "' t",
      "! \"",
      "u g",
      "Ġl oo",
      "v ed",
      "t er",
      "Ġwe re",
      "o re",
      "On ce",
      "Ġl o",
      "e c",
      "Ġh im",
      "Ġto o",
      "Ġg o",
      "Ġb o",
      "Ġs e",
      "ir l",
      "Ġa re",
      "Ġ j",
      "ĠT im",
      "ar d",
      "Ġwant ed",
      "il l",
      "Ġg irl",
      "Ġup on",
      "Ġthe m",
      "Ġ out",
      "Ġa t",
      "u r",
      "i nd",
      "Ġthe ir",
      "f u",
      "Ġs p",
      "w ay",
      "Ġ A",
      "Ġsm il",
      "Ġd id",
      "Ġc ould",
      "he n",
      "Ġha ve",
      "a in",
      "ar t",
      "Ġe x",
      "he d",
      "r om",
      "Ġw ent",
      "Ġa r",
      "i c",
      "Ġc an",
      "Ġ J",
      "l p",
      "fu l",
      "ĠB en",
      "oo d",
      "? \"",
      "h ing",
      "Ġfriend s",
      "Ġn am",
      "ig ht",
      "Ġa ll",
      "Ġhe lp",
      "Ġk n",
      "u m",
      "on e",
      "ar k",
      "Ġb ack",
      "Ġs ay",
      "Y ou",
      "Ġf un",
      "Ġc l",
      "ĠT om",
      "a re",
      "Ġn o",
      "Ġl e",
      "o p",
      "Ġsmil ed",
      "Ġs c",
      "Ġnam ed",
      "Ġa l",
      "ou g",
      "Ġlo ved",
      "s ide",
      "el t",
      "Ġ One",
      "Ġm an",
      "Ġas ked",
      "i ck",
      "Ġto y"
    ]
  }
}