{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "he": 257,
      "Ġt": 258,
      "Ġa": 259,
      "Ġs": 260,
      "Ġw": 261,
      "nd": 262,
      "Ġthe": 263,
      "ed": 264,
      "Ġand": 265,
      "Ġto": 266,
      "Ġb": 267,
      "in": 268,
      "Ġh": 269,
      "Ġwa": 270,
      "re": 271,
      "ou": 272,
      "Ġf": 273,
      "it": 274,
      "Ġl": 275,
      "Ġc": 276,
      "Ġd": 277,
      "er": 278,
      "Ġhe": 279,
      "Ġm": 280,
      "Ġp": 281,
      "Ġwas": 282,
      "om": 283,
      "ĠT": 284,
      "Ġo": 285,
      "ay": 286,
      "ar": 287,
      "is": 288,
      "ing": 289,
      "il": 290,
      "Ġg": 291,
      "id": 292,
      "at": 293,
      "en": 294,
      "Ġn": 295,
      "Ġsa": 296,
      "Ġha": 297,
      "ĠS": 298,
      "ĠThe": 299,
      "an": 300,
      "im": 301,
      "or": 302,
      "on": 303,
      "Ġit": 304,
      "Ġth": 305,
      "ll": 306,
      "le": 307,
      "ĠH": 308,
      "Ġher": 309,
      "ot": 310,
      "et": 311,
      "ir": 312,
      "ĠShe": 313,
      "es": 314,
      "ĠHe": 315,
      "Ġin": 316,
      "ver": 317,
      "ut": 318,
      "ow": 319,
      "ĠThey": 320,
      "ck": 321,
      "Ġe": 322,
      "Ġu": 323,
      "ld": 324,
      "Ġy": 325,
      "oo": 326,
      "Ġsaid": 327,
      "ig": 328,
      "Ġ\"": 329,
      "ily": 330,
      "Ġr": 331,
      "Ġbe": 332,
      "am": 333,
      "Ġst": 334,
      "ĠI": 335,
      "ce": 336,
      "ke": 337,
      "Ġshe": 338,
      "ve": 339,
      "pp": 340,
      "ith": 341,
      "Ġwith": 342,
      "Lily": 343,
      "On": 344,
      "Ġon": 345,
      "Ġyou": 346,
      "Ġof": 347,
      "ked": 348,
      "ri": 349,
      "Ġso": 350,
      "nt": 351,
      "Ġhis": 352,
      "Ġpl": 353,
      "ad": 354,
      "very": 355,
      "Ġday": 356,
      "Ġthat": 357,
      "Ġup": 358,
      "Ġplay": 359,
      "Ġhad": 360,
      "st": 361,
      "Ġthey": 362,
      "Ġwe": 363,
      "ĠLily": 364,
      "Ġmom": 365,
      "Ġfor": 366,
      "ĠB": 367,
      "el": 368,
      "un": 369,
      "ould": 370,
      "'s": 371,
      "my": 372,
      "The": 373,
      "Ġli": 374,
      "ch": 375,
      "ent": 376,
      "Ġhapp": 377,
      "Ġwant": 378,
      "itt": 379,
      "Ġsh": 380,
      "out": 381,
      "her": 382,
      "Ġdo": 383,
      "ly": 384,
      "Ġnot": 385,
      "ome": 386,
      "se": 387,
      "Ġvery": 388,
      "ound": 389,
      "end": 390,
      "all": 391,
      "Ġwh": 392,
      "ime": 393,
      "ittle": 394,
      "Ġk": 395,
      "Ġtime": 396,
      "Ġlittle": 397,
      "al": 398,
      "Ġthere": 399,
      "Ġne": 400,
      "ht": 401,
      "ĠM": 402,
      "Ġre": 403,
      "Ġhappy": 404,
      "Ġsm": 405,
      "Ġbig": 406,
      "Ġis": 407,
      "ĠĊ": 408,
      "ĠIt": 409,
      "Ġbut": 410,
      "ack": 411,
      "Ġan": 412,
      "Ġsaw": 413,
      "riend": 414,
      ".\"": 415,
      "Ġfriend": 416,
      "ry": 417,
      "Ġas": 418,
      "ra": 419,
      "One": 420,
      "ide": 421,
      "ake": 422,
      "'t": 423,
      "!\"": 424,
      "ug": 425,
      "Ġloo": 426,
      "ved": 427,
      "ter": 428,
      "Ġwere": 429,
      "ore": 430,
      "Once": 431,
      "Ġlo": 432,
      "ec": 433,
      "Ġhim": 434,
      "Ġtoo": 435,
      "Ġgo": 436,
      "Ġbo": 437,
      "Ġse": 438,
      "irl": 439,
      "Ġare": 440,
      "Ġj": 441,
      "ĠTim": 442,
      "ard": 443,
      "Ġwanted": 444,
      "ill": 445,
      "Ġgirl": 446,
      "Ġupon": 447,
      "Ġthem": 448,
      "Ġout": 449,
      "Ġat": 450,
      "ur": 451,
      "ind": 452,
      "Ġtheir": 453,
      "fu": 454,
      "Ġsp": 455,
      "way": 456,
      "ĠA": 457,
      "Ġsmil": 458,
      "Ġdid": 459,
      "Ġcould": 460,
      "hen": 461,
      "Ġhave": 462,
      "ain": 463,
      "art": 464,
      "Ġex": 465,
      "hed": 466,
      "rom": 467,
      "Ġwent": 468,
      "Ġar": 469,
      "ic": 470,
      "Ġcan": 471,
      "ĠJ": 472,
      "lp": 473,
      "ful": 474,
      "ĠBen": 475,
      "ood": 476,
      "?\"": 477,
      "hing": 478,
      "Ġfriends": 479,
      "Ġnam": 480,
      "ight": 481,
      "Ġall": 482,
      "Ġhelp": 483,
      "Ġkn": 484,
      "um": 485,
      "one": 486,
      "ark": 487,
      "Ġback": 488,
      "Ġsay": 489,
      "You": 490,
      "Ġfun": 491,
      "Ġcl": 492,
      "ĠTom": 493,
      "are": 494,
      "Ġno": 495,
      "Ġle": 496,
      "op": 497,
      "Ġsmiled": 498,
      "Ġsc": 499,
      "Ġnamed": 500,
      "Ġal": 501,
      "oug": 502,
      "Ġloved": 503,
      "side": 504,
      "elt": 505,
      "ĠOne": 506,
      "Ġman": 507,
      "Ġasked": 508,
      "ick": 509,
      "Ġtoy": 510,
      "Ġlike": 511
    },
    "merges": [
      "h e",
      "Ġ t",
      "Ġ a",
      "Ġ s",
      "Ġ w",
      "n d",
      "Ġt he",
      "e d",
      "Ġa nd",
      "Ġt o",
      "Ġ b",
      "i n",
      "Ġ h",
      "Ġw a",
      "r e",
      "o u",
      "Ġ f",
      "i t",
      "Ġ l",
      "Ġ c",
      "Ġ d",
      "e r",
      "Ġ he",
      "Ġ m",
      "Ġ p",
      "Ġwa s",
      "o m",
      "Ġ T",
      "Ġ o",
      "a y",
      "a r",
      "i s",
      "in g",
      "i l",
      "Ġ g",
      "i d",
      "a t",
      "e n",
      "Ġ n",
      "Ġs a",
      "Ġh a",
      "Ġ S",
      "ĠT he",
      "a n",
      "i m",
      "o r",
      "o n",
      "Ġ it",
      "Ġt h",
      "l l",
      "l e",
      "Ġ H",
      "Ġhe r",
      "o t",
      "e t",
      "i r",
      "ĠS he",
      "e s",
      "ĠH e",
      "Ġ in",
      "v er",
      "u t",
      "o w",
      "ĠThe y",
      "c k",
      "Ġ e",
      "Ġ u",
      "l d",
      "Ġ y",
      "o o",
      "Ġsa id",
      "i g",
      "Ġ \"",
      "il y",
      "Ġ r",
      "Ġb e",
      "a m",
      "Ġs t",
      "Ġ I",
      "c e",
      "k e",
      "Ġs he",
      "v e",
      "p p",
      "it h",
      "Ġw ith",
      "L ily",
      "O n",
      "Ġo n",
      "Ġy ou",
      "Ġo f",
      "k ed",
      "r i",
      "Ġs o",
      "n t",
      "Ġh is",
      "Ġp l",
      "a d",
      "ver y",
      "Ġd ay",
      "Ġth at",
      "Ġu p",
      "Ġpl ay",
      "Ġha d",
      "s t",
      "Ġthe y",
      "Ġw e",
      "Ġ Lily",
      "Ġm om",
      "Ġf or",
      "Ġ B",
      "e l",
      "u n",
      "ou ld",
      "' s",
      "m y",
      "T he",
      "Ġl i",
      "c h",
      "en t",
      "Ġha pp",
      "Ġwa nt",
      "it t",
      "Ġs h",
      "ou t",
      "he r",
      "Ġd o",
      "l y",
      "Ġn ot",
      "om e",
      "s e",
      "Ġ very",
      "ou nd",
      "e nd",
      "a ll",
      "Ġw h",
      "im e",
      "itt le",
      "Ġ k",
      "Ġt ime",
      "Ġl ittle",
      "a l",
      "Ġthe re",
      "Ġn e",
      "h t",
      "Ġ M",
      "Ġ re",
      "Ġhapp y",
      "Ġs m",
      "Ġb ig",
      "Ġ is",
      "Ġ Ċ",
      "ĠI t",
      "Ġb ut",
      "a ck",
      "Ġa n",
      "Ġsa w",
      "ri end",
      ". \"",
      "Ġf riend",
      "r y",
      "Ġa s",
      "r a",
      "On e",
      "id e",
      "a ke",
      "' t",
      "! \"",
      "u g",
      "Ġl oo",
      "v ed",
      "t er",
      "Ġwe re",
      "o re",
      "On ce",
      "Ġl o",
      "e c",
      "Ġh im",
      "Ġto o",
      "Ġg o",
      "Ġb o",
      "Ġs e",
      "ir l",
      "Ġa re",
      "Ġ j",
      "ĠT im",
      "ar d",
      "Ġwant ed",
      "il l",
      "Ġg irl",
      "Ġup on",
      "Ġthe m",
      "Ġ out",
      "Ġa t",
      "u r",
      "i nd",
      "Ġthe ir",
      "f u",
      "Ġs p",
      "w ay",
      "Ġ A",
      "Ġsm il",
      "Ġd id",
      "Ġc ould",
      "he n",
      "Ġha ve",
      "a in",
      "ar t",
      "Ġe x",
      "he d",
      "r om",
      "Ġw ent",
      "Ġa r",
      "i c",
      "Ġc an",
      "Ġ J",
      "l p",
      "fu l",
      "ĠB en",
      "oo d",
      "? \"",
      "h ing",
      "Ġfriend s",
      "Ġn am",
      "ig ht",
      "Ġa ll",
      "Ġhe lp",
      "Ġk n",
      "u m",
      "on e",
      "ar k",
      "Ġb ack",
      "Ġs ay",
      "Y ou",
      "Ġf un",
      "Ġc l",
      "ĠT om",
      "a re",
      "Ġn o",
      "Ġl e",
      "o p",
      "Ġsmil ed",
      "Ġs c",
      "Ġnam ed",
      "Ġa l",
      "ou g",
      "Ġlo ved",
      "s ide",
      "el t",
      "Ġ One",
      "Ġm an",
      "Ġas ked",
      "i ck",
      "Ġto y",
      "Ġli ke"
    ]
  }
}